tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "coreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
brew "zsh"
brew "wget"
brew "vim"
brew "grep"
brew "git"
brew "asdf"
brew "gpg"
brew "gh"
brew "gawk"
# https://github.com/tj/git-extras/blob/master/Commands.md
brew "git-extras"
brew "openssh"
brew "fzf"
brew "tldr"
brew "mas"
brew "ssh-copy-id"
brew "vale"
brew "awscli"

# Quick Look plugins
cask "qlcolorcode"
cask "qlstephen"
cask "quicklook-json"
cask "qlmarkdown"

cask "font-fira-code"

cask "little-snitch"
cask "microsoft-edge"
cask "hammerspoon"
cask "karabiner-elements"
cask "visual-studio-code-insiders"
cask "raycast"
cask "middle"
cask "1password"
cask "1password-cli"
cask "appcleaner"
cask "beamer"
cask "dash"
cask "discord"
cask "fantastical"
cask "gitup"
cask "bruno"
cask "ghostty"
cask "slack"
cask "notion"
cask "figma"
cask "zoom"

mas "Lungo", id: 1263070803
mas "System Color Picker", id: 1545870783
mas "Data Jar", id: 1453273600
mas "Pins for Pinboard", id: 1547106997
mas "Velja", id: 1607635845
mas "Pure Paste", id: 1611378436
mas "Reeder 5", id: 1529448980
mas "HEIC Converter", id: 1294126402
mas "FoodNoms Nutrition Tracker", id: 1479461686
